# Подключение к БД
from sqlalchemy import create_engine
# create_engine — функция SQLAlchemy для создания "движка" подключения к БД
# Движок — это объект который знает КАК подключаться к БД
# Но само подключение не открывает — только описывает настройки
from sqlalchemy.orm import sessionmaker
# sessionmaker — фабрика для создания сессий
# Сессия — это рабочая область для работы с БД
# Через сессию делаются все запросы: SELECT, INSERT, UPDATE, DELETE
from app.core.config import get_settings
# Импортируем функцию получения настроек из config.py


settings = get_settings()
# Вызываем функцию и получаем объект Settings с настройками
# settings.DATABASE_URL — строка подключения к БД
engine = create_engine(settings.DATABASE_URL)
# Создаём "движок" — объект который умеет подключаться к PostgreSQL
# Передаём строку подключения из настроек
# Реальное соединение с БД НЕ открывается здесь — только настройки сохраняются
Sessionlocal = sessionmaker(bind=engine)
# Создаём фабрику сессий
# bind=engine — привязываем фабрику к нашему движку
# Теперь каждый раз когда вызовем Sessionlocal() — получим новую сессию
# которая уже знает к какой БД подключаться

# Sessionlocal — это как штамп для печатания одинаковых сессий
# Sessionlocal() → новая сессия → работаем с БД → закрываем сессию


def get_db():
    """Функция для инъекции сессии Базы Данных"""
    db = Sessionlocal()
    # Создаём новую сессию (открываем соединение с БД)
    # Каждый HTTP-запрос получает свою отдельную сессию

    try:
        yield db
        # yield — превращает функцию в генератор
        # Здесь функция "приостанавливается" и передаёт сессию в эндпоинт
        # Пока эндпоинт работает — сессия открыта
        # После завершения эндпоинта — выполнение продолжается дальше (в finally)
    finally:
        db.close()
        # finally — выполнится ВСЕГДА, даже если была ошибка
        # Закрываем сессию — освобождаем соединение с БД
        # Если не закрывать — соединения накопятся и БД перестанет работать

# Работа функции get_db():

# Запрос пришёл
#       ↓
# get_db() создаёт сессию
#       ↓
# yield db — сессия передана в эндпоинт
#       ↓
# эндпоинт работает с БД
#       ↓
# finally: db.close() — сессия закрыта
#       ↓
# Ответ отправлен клиенту

# Если не закрывать сессии — соединения накапливаются и БД перестаёт принимать новые подключения.